import {Book} from "@/models/book.model";

/* Template */
// {
//     id: '',
//         author: '',
//     publisher: '',
//     title: '',
//     description: '',
//     ISBN: '',
//     genres: [],
//     language: '',
//     yearOfPublication: ,
//     coverImg: ''
// },

export const BOOKS: Book[] = [
    {
        id: 'c2d4fab9-758c-4924-921e-9410124b1e47',
        author: 'Славенка Дракуліч',
        publisher: 'Yakaboo Publishing',
        title: 'Як ми пережили комунізм і навіть сміялися',
        description: 'Для західних аудиторій Славенка Дракуліч, хорватська письменниця і журналістка, стала голосом країн з-поза Берлінського муру ще до його падіння 1989 року. Її есеї були не тільки затребуваною оповіддю про життя в соціалістичному таборі: Славенка Дракуліч також однією з перших почала пояснювати, як жили у соцтаборі жінки. Уже класична книжка Дракуліч «Як ми пережили комунізм і навіть сміялися» відкрила Заходу цей жіночий світ — приватний, професійний, активістський. Він, утім, майже так само невідомий і нам, адже для тодішніх мешканців Радянського Союзу відвідини закордону, навіть «братніх» соціалістичних країн, були рідкісною нагодою і віхою в житті, а покоління, для яких подорожі не є чимось надзвичайним, побачили вже зовсім іншу Східну Європу. Дещо в цих есеях видається спогадами про минулу епоху, проте дещо зрезонує з досвідом навіть тих, хто народився вже після написання книжки.',
        ISBN: '978–617–7544–10–3',
        genres: ['Історія', 'Саморозвиток'],
        language: 'Українська',
        yearOfPublication: 2019,
        coverImg: 'https://static.yakaboo.ua/media/cloudflare/product/webp/600x840/_/_/__yakaboo_publishing.jpg'
    },
    {
        id: 'e51678d7-1120-4421-b3dc-679d628c7281',
        author: 'Денiел Ґоулман',
        publisher: 'Vivat',
        title: 'Емоційний інтелект',
        description: 'Залежність між інтелектом і життєвим успіхом зрозуміла і майже аксіоматична. А як впливає на життєві здобутки емоційна сфера людини? Які емоційні складники передусім формують нашу долю? Чи можна (і як саме, якщо так) виправити емоційні моделі, закладені в людині, коли вони гальмують її рух до кращого? І взагалі, чи реально об\'єднати два слова - "емоційний" та "інтелект" - і не дістати суперечність? ВІдповіді на ці питання дає оперта на наукову базу й водночас легко написана для широкої аудиторії книжка Девіда Ґоулмана - один із безперечних психологічних бестселерів останніх десятиліть.',
        ISBN: '978-966-942-116-6',
        genres: ['Психологія', 'Бізнес', 'Медицина', 'Відносини'],
        language: 'Українська',
        yearOfPublication: 2018,
        coverImg: 'https://static.yakaboo.ua/media/cloudflare/product/webp/600x840/i/m/img651_cr_3.png'
    },
    {
        id: '0e777e43-1708-4860-83f5-592e68630f87',
        author: 'Вільям Макрейвен',
        publisher: 'КМ-БУКС',
        title: 'Застеляйте ліжко. Дрібниці, які можуть змінити ваше життя... і, можливо, світ',
        description: 'У цьому невеличкому виданні адмірал Вільям Г. Макрейвен, командувач Військово-морських сил США у відставці, визначив десять правил, яких він особисто завжди намагався дотримуватися і які допомогли йому з честю подолати чимало життєвих негараздів. Оригінально сформульовані правила на кшталт "не боятися акул", "не вдаряти передчасно у дзвін", "щоранку застеляти ліжко" мають глибокий підтекст. Автор розкриває суть кожного правила, розповідає цікаві історії про людей, які свого часу надихали його власною дисципліною, наполегливістю, благородством і мужністю.',
        ISBN: '978-966-948-783-4',
        genres: ['Бізнес', 'Мотивація', 'Саморозвиток'],
        language: 'Українська',
        yearOfPublication: 2023,
        coverImg: 'https://static.yakaboo.ua/media/cloudflare/product/webp/600x840/i/m/img_16015.jpg'
    },
    {
        id: '0e777e43-1708-4862-83f6-592e68630f87',
        author: 'Джеймс Клір',
        publisher: 'КМ-БУКС',
        title: 'Атомні звички. Легкий і перевірений спосіб набути корисних звичок і позбутися звичок шкідливих',
        description: 'У книзі Джеймс Клір ділиться надзвичайно цікавою і по-справжньому продуктивною методикою напрацювання корисних звичок. В її основі лежить поняття чотириступеневої моделі звичок (подразник, прагнення, відгук, винагорода), а також чотири породжені цією моделлю закони зміни поведінки. Викладений матеріал підтверджується результатами наукових досліджень, проте книгу слід трактувати не як наукову розвідку, а як посібник з експлуатації, що містить мудрі практичні поради та пояснення механізмів створення і змінювання власних звичок.',
        ISBN: '978-966-948-375-1',
        genres: ['Бізнес', 'Мотивація', 'Саморозвиток'],
        language: 'Українська',
        yearOfPublication: 2021,
        coverImg: 'https://static.yakaboo.ua/media/cloudflare/product/webp/600x840/i/m/img_46560.jpg'
    },
    {
        id: '0e111e43-1708-4860-83f5-592e68630f99',
        author: 'Леся Українка',
        publisher: 'Ранок',
        title: 'Книга Мавка. Лісова пісня',
        description: 'Минають роки, минають десятиліття, але ми знову й знову повертаємось до деяких літературних творів... Сьогодні, коли поширюється інтерес до нашої історії та культури, пропонуємо вам перечитати драму-феєрію відомої української письменниці й поетеси Лесі Українки. Цей твір розповідає про зв’язок людини і природи, про безсмертя вічних людських цінностей, добро і зло; про пошук гармонії, кохання і зраду; про матеріальне і духовне в житті. Це гімн справжньому коханню. Завдяки прекрасним ілюстраціям дивовижного краю з майбутнього анімаційного фільму «Мавка. Лісова пісня» пориньте у цей фантастичний світ і насолоджуйтеся колоритною мелодійною українською мовою. ',
        ISBN: '9789667510848',
        genres: ['Художня', 'Проза', 'Классика'],
        language: 'Українська',
        yearOfPublication: 2023,
        coverImg: 'https://static.yakaboo.ua/media/cloudflare/product/webp/600x840/_/9/_902214_-943-650.jpg'
    },
    {
        id: '0e777e43-1708-4860-83f5-592e77130f09',
        author: 'Bedros Keuilian',
        publisher: 'BenBella Books',
        title: 'Man Up: How to Cut the Bullshit and Kick Ass in Business (And in Life)',
        description: 'Man Up: How to Cut the Bullshit and Dominate Your Path is your guide to doing exactly that. Keuilian, founder and CEO of Fit Body Boot Camp and known as the "hidden genius" behind many of the most successful brands and businesses throughout multiple industries, will teach you how to break out of the sea of mediocrity, get singularly focused on your purpose, and do what it takes - not only to achieve but dominate your goals.',
        ISBN: '1946885037',
        genres: ['Бізнес', 'Мотивація', 'Саморозвиток'],
        language: 'English',
        yearOfPublication: 2023,
        coverImg: 'https://m.media-amazon.com/images/I/41mOBFvp2YL.jpg'
    },
];
